package hw1;

public class HW1 {
	public static void main(String[] args) {
		System.out.println("*****************************************");
		System.out.println("*  __    _     _        __  __          *");
		System.out.println("* /    ||_|/| / \\/|     __)|_  |_|| |/| *");
		System.out.println("* \\__\\_|| | | \\_/ | ___ __)__) | ||^| | *");
		System.out.println("*****************************************");
//		繪圖工具：https://www.asciiart.eu/text-to-ascii-art
		
//		1. 請設計一支Java程式，計算12、6這兩個數值的和與積。
		System.out.println("第一題：\n和：" + (12+6) + "\n積：" + 12*6);
		System.out.println("---------------------------------------------------------------------------");
		
//		2. 請設計一支Java程式，計算200顆蛋共是幾打幾顆？（一打為12顆）
		System.out.println("第二題：\n200顆蛋是" + 200/12 + "打" + 200%12 + "顆。");
		System.out.println("---------------------------------------------------------------------------");
		
//		3. 請由程式算出256559秒為多少天、多少小時、多少分與多少秒。
		int sec = 256559%60;
		int min = (256559/60)%60;
		int hr = (256559/(60*60))%24;
		int day = 256559/(60*60*24);
		System.out.println("第三題：\n256559秒是" + day + "天" + hr + "小時" + min + "分" + sec + "秒。");
		System.out.println("---------------------------------------------------------------------------");
		
//		4. 請定義一個常數為3.1415（圓周率），並計算半徑為5的圓面積與圓周長。
		final double PI = 3.1415;
		System.out.println("第四題：\n半徑為5的圓面積是" + PI*5*5 + "平方單位，圓周長是" + 2*PI*5 + "單位。");
		System.out.println("---------------------------------------------------------------------------");
		
//		5. 某人在銀行存入150萬，銀行利率為2%，如果每年利息都繼續存入銀行，
//	       請用程式計算10年後，本金加利息共有多少錢（用複利計算，公式請自行google）。
		double money = 1_500_000;
		double rate = 0.02;
		for (int year=1; year<=10; year++) {
			money *= (1 + rate);
		}
		System.out.println("第五題：\n本金加利息共有" + money + "元。");
		System.out.println("---------------------------------------------------------------------------");
		
//		6. 請寫一隻程式,利用System.out.println()印出以下三個運算式結果:
//		   5 + 5
//		   5 + '5'
//		   5 + "5"
//		   並請用註解各別說明答案的產生原因。
		System.out.println("第六題：");
		System.out.println(5 + 5);
//		前面的5是int，後面的5也是int，int+int在計算時不需要型別轉換，直接就是兩個int整數相加5+5=10。
		System.out.println(5 + '5');
//		前面的5是int，後面的'5'是char，int+char在計算時，需要做型別轉換（將char轉換成int），而'5'的編碼是53。
//		因此，5 + '5'在經過型別轉換後會變成5 + 53，也就是58。
		System.out.println(5 + "5");
//		前面的5是int，後面的"5"是String，int+String在計算時，需要做型別轉換（將int轉換成String）。
//		因此5 + "5"在經過型別轉換後會變成"5" + "5"，也就是將兩個String合併，變成"55"。
	}
}
